simpleProcess/airfoil_OFJ_pitching/mesh/nonRotating/system/blockMeshDict
/*-------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.2                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(

	(0.0 0.5 -0.000714) //0
	(0.289392 0.5 0.07749) //1
	(0.289392 0.5 -0.073086) //2
	(0.6 0.5 -0.005346) //3
	(0.0 -0.5 -0.000714) //4
	(0.289392 -0.5 0.07749) //5
	(0.289392 -0.5 -0.073086) //6
	(0.6 -0.5 -0.005346) //7
	(0.289392 0.5 0.8) //8
	(1.1 0.5 -0.005346) //9
	(0.289392 0.5 -0.8) //10
	(-0.5 0.5 -0.000714) //11
	(0.289392 -0.5 0.8) //12
	(1.1 -0.5 -0.005346) //13
	(0.289392 -0.5 -0.8) //14
	(-0.5 -0.5 -0.000714) //15
	(-7.8 0.5 -0.000714) //16
	(0.289392 0.5 7.8) //17
	(0.289392 0.5 -7.8) //18
	(-7.8 -0.5 -0.000714) //19
	(0.289392 -0.5 7.8) //20
	(0.289392 -0.5 -7.8) //21
	(0.95053704391 0.5 0.650539433471) //22
	(0.95053704391 0.5 -0.650539433471) //23
	(0.95053704391 0.5 7.8) //24
	(0.95053704391 0.5 -7.8) //25
	(0.95053704391 -0.5 0.650539433471) //26
	(0.95053704391 -0.5 -0.650539433471) //27
	(0.95053704391 -0.5 7.8) //28
	(0.95053704391 -0.5 -7.8) //29
	(16.2 0.5 0.650539433471) //30
	(16.2 0.5 -0.650539433471) //31
	(16.2 -0.5 0.650539433471) //32
	(16.2 -0.5 -0.650539433471) //33
	(16.2 0.5 7.8) //34
	(16.2 0.5 -7.8) //35
	(16.2 -0.5 7.8) //36
	(16.2 -0.5 -7.8) //37
	(16.2 0.5 0.0) //38
	(16.2 -0.5 0.0) //39
	(0.289392 0.5 0.86) //40
	(1.16 0.5 -0.005346) //41
	(0.289392 0.5 -0.86) //42
	(-0.56 0.5 -0.000714) //43
	(0.289392 -0.5 0.86) //44
	(1.16 -0.5 -0.005346) //45
	(0.289392 -0.5 -0.86) //46
	(-0.56 -0.5 -0.000714) //47
	(0.289392 0.5 0.92) //48
	(1.22 0.5 -0.005346) //49
	(0.289392 0.5 -0.92) //50
	(-0.62 0.5 -0.000714) //51
	(0.289392 -0.5 0.92) //52
	(1.22 -0.5 -0.005346) //53
	(0.289392 -0.5 -0.92) //54
	(-0.62 -0.5 -0.000714) //55
	(0.90811071496 0.5 0.608112948679) //56
	(0.90811071496 0.5 -0.608112948679) //57
	(0.90811071496 -0.5 0.608112948679) //58
	(0.90811071496 -0.5 -0.608112948679) //59
	(0.6 0.5 0.74161984871) //60
	(0.6 0.5 0.0348661859753) //61
	(0.6 0.5 -0.032408146226) //62
	(0.6 0.5 -0.74161984871) //63
	(1.02138061432 0.5 0.345846800299) //64
	(0.7104 0.5 0.0348661859753) //65
	(0.7104 0.5 -0.005346) //66
	(0.7104 0.5 -0.032408146226) //67
	(1.02138061432 0.5 -0.345846800299) //68
	(0.6 -0.5 0.74161984871) //69
	(0.6 -0.5 0.0348661859753) //70
	(0.6 -0.5 -0.032408146226) //71
	(0.6 -0.5 -0.74161984871) //72
	(1.02138061432 -0.5 0.345846800299) //73
	(0.7104 -0.5 0.0348661859753) //74
	(0.7104 -0.5 -0.005346) //75
	(0.7104 -0.5 -0.032408146226) //76
	(1.02138061432 -0.5 -0.345846800299) //77
	(0.289392 0.5 0.104730328453) //78
	(0.289392 0.5 -0.0997364099401) //79
	(0.289392 -0.5 0.104730328453) //80
	(0.289392 -0.5 -0.0997364099401) //81
	(-0.0276 0.5 -0.000714) //82
	(-0.0276 -0.5 -0.000714) //83
	(0.6225 0.5 0.797241337363) //84
	(1.0754841604 0.5 0.371785310322) //85
	(1.0754841604 0.5 -0.371785310322) //86
	(0.6225 0.5 -0.797241337363) //87
	(0.6225 -0.5 0.797241337363) //88
	(1.0754841604 -0.5 0.371785310322) //89
	(1.0754841604 -0.5 -0.371785310322) //90
	(0.6225 -0.5 -0.797241337363) //91
	(0.6 0.5 0.005622) //92
	(0.7104 0.5 0.005622) //93
	(1.0987512321 0.5 0.0446818668022) //94
	(1.15865757451 0.5 0.0480330068124) //95
	(0.6 -0.5 0.005622) //96
	(0.7104 -0.5 0.005622) //97
	(1.0987512321 -0.5 0.0446818668022) //98
	(1.15865757451 -0.5 0.0480330068124) //99
	(1.13860490636 0.5 0.190635282749) //100
	(1.19711222541 0.5 0.203935418754) //101
	(16.2 0.5 0.203935418754) //102
	(1.13860490636 -0.5 0.190635282749) //103
	(1.19711222541 -0.5 0.203935418754) //104
	(16.2 -0.5 0.203935418754) //105

);

blocks
(

    hex (43 40 48 51 47 44 52 55) shape (180 8 1) edgeGrading (1 1 1 1 1.06976744186 1.06976744186 1.06976744186 1.06976744186 1 1 1 1)
    hex (40 56 22 48 44 58 26 52) shape (90 8 1) edgeGrading (1 1 1 1 1.06976744186 1.06976744186 1.06976744186 1.06976744186 1 1 1 1)
    hex (56 100 101 22 58 103 104 26) shape (90 8 1) edgeGrading (1 1 1 1 1.06976744186 1.06976744186 1.06976744186 1.06976744186 1 1 1 1)
    hex (100 41 49 101 103 45 53 104) shape (45 8 1) edgeGrading (1 1 1 1 1.06976744186 1.06976744186 1.06976744186 1.06976744186 1 1 1 1)
    hex (41 57 23 49 45 59 27 53) shape (90 8 1) edgeGrading (1 1 1 1 1.06976744186 1.06976744186 1.06976744186 1.06976744186 1 1 1 1)
    hex (57 42 50 23 59 46 54 27) shape (90 8 1) edgeGrading (1 1 1 1 1.06976744186 1.06976744186 1.06976744186 1.06976744186 1 1 1 1)
    hex (42 43 51 50 46 47 55 54) shape (180 8 1) edgeGrading (1 1 1 1 1.06976744186 1.06976744186 1.06976744186 1.06976744186 1 1 1 1)
    hex (51 48 17 16 55 52 20 19) shape (180 250 1) edgeGrading (1 0.0299970842814 0.0299970842814 1 8.2106508038 8.2106508038 8.2106508038 8.2106508038 1 1 1 1)
    hex (50 51 16 18 54 55 19 21) shape (180 250 1) edgeGrading (1 33.3365733355 33.3365733355 1 8.2106508038 8.2106508038 8.2106508038 8.2106508038 1 1 1 1)
    hex (48 22 24 17 52 26 28 20) shape (90 250 1) edgeGrading (1 1 1 1 8.2106508038 8.69764923608 8.69764923608 8.2106508038 1 1 1 1)
    hex (23 50 18 25 27 54 21 29) shape (90 250 1) edgeGrading (1 1 1 1 8.69764923608 8.2106508038 8.2106508038 8.69764923608 1 1 1 1)
    hex (22 30 34 24 26 32 36 28) shape (300 250 1) edgeGrading (19.9059017513 19.9059017513 19.9059017513 19.9059017513 8.69764923608 8.69764923608 8.69764923608 8.69764923608 1 1 1 1)
    hex (23 25 35 31 27 29 37 33) shape (250 300 1) edgeGrading (8.69764923608 8.69764923608 8.69764923608 8.69764923608 19.9059017513 19.9059017513 19.9059017513 19.9059017513 1 1 1 1)
    hex (49 38 102 101 53 39 105 104) shape (300 45 1) edgeGrading (19.4181544858 19.459589228 19.459589228 19.4181544858 1 1 1 1 1 1 1 1)
    hex (101 102 30 22 104 105 32 26) shape (300 90 1) edgeGrading (19.459589228 19.9059017513 19.9059017513 19.459589228 1 1 1 1 1 1 1 1)
    hex (49 23 31 38 53 27 33 39) shape (90 300 1) edgeGrading (1 1 1 1 19.4181544858 19.9059017513 19.9059017513 19.4181544858 1 1 1 1)

);

edges
(

arc 43 40 (-0.308111831819 0.5 0.608111831822)
arc 40 56 (0.470855624311 0.5 0.842857256979)
arc 56 100 (1.11211126823 0.5 0.28297577285)
arc 100 41 (1.15463448897 0.5 0.095916058432)
arc 41 57 (1.14285725694 0.5 -0.170855624484)
arc 57 42 (0.470855624311 0.5 -0.842857256979)
arc 42 43 (-0.308111831819 0.5 -0.608111831822)
arc 47 44 (-0.308111831819 -0.5 0.608111831822)
arc 44 58 (0.470855624311 -0.5 0.842857256979)
arc 58 103 (1.11211126823 -0.5 0.28297577285)
arc 103 45 (1.15463448897 -0.5 0.095916058432)
arc 45 59 (1.14285725694 -0.5 -0.170855624484)
arc 59 46 (0.470855624311 -0.5 -0.842857256979)
arc 46 47 (-0.308111831819 -0.5 -0.608111831822)
arc 51 48 (-0.35053823869 0.5 0.650538238693)
arc 48 22 (0.482775784147 0.5 0.901661251651)
arc 22 101 (1.16877019392 0.5 0.30271826863)
arc 101 49 (1.21426015099 0.5 0.102607876462)
arc 49 23 (1.20166125161 0.5 -0.182775784331)
arc 23 50 (0.482775784147 0.5 -0.901661251651)
arc 50 51 (-0.35053823869 0.5 -0.650538238693)
arc 55 52 (-0.35053823869 -0.5 0.650538238693)
arc 52 26 (0.482775784147 -0.5 0.901661251651)
arc 26 104 (1.16877019392 -0.5 0.30271826863)
arc 104 53 (1.21426015099 -0.5 0.102607876462)
arc 53 27 (1.20166125161 -0.5 -0.182775784331)
arc 27 54 (0.482775784147 -0.5 -0.901661251651)
arc 54 55 (-0.35053823869 -0.5 -0.650538238693)
arc 16 17 (-5.51543289324 0.5 5.51543289324)
arc 16 18 (-5.51543289324 0.5 -5.51543289324)
arc 19 20 (-5.51543289324 -0.5 5.51543289324)
arc 19 21 (-5.51543289324 -0.5 -5.51543289324)

);

boundary
(

	inlet
	{
		type patch;
		faces
		(
		(17 20 19 16) 
		(16 19 21 18)
		);
	}

	outlet
	{
		type patch;
		faces
		(
		(38 31 33 39)
		(34 30 32 36)
		(30 102 105 32)
		(102 38 39 105)
		(31 35 37 33)
		);
	}

	topAndBottom
	{
		type patch;
		faces
		(
		(24 34 36 28)
		(17 24 28 20)
		(18 21 29 25)
		(25 29 37 35)
		);
	}

	rotbox
	{
		type patch;
		faces
		(
		(43 40 44 47)
		(40 56 58 44)
		(56 100 103 58)
		(100 41 45 103)
		(41 57 59 45)
		(57 42 46 59)
		(42 43 47 46)
		);
	}

	front
	{
		type empty;
		faces
		(
		(16 51 48 17)
		(16 18 50 51)
		(51 43 40 48)
		(48 22 24 17)
		(40 56 22 48)
		(56 100 101 22)
		(100 41 49 101)
		(18 25 23 50)
		(50 23 57 42)
		(23 49 41 57)
		(51 50 42 43)
		(22 30 34 24)
		(49 38 102 101)
		(101 102 30 22)
		(23 31 38 49)
		(25 35 31 23)
		);
	}

	back
	{
		type empty;
		faces
		(
		(19 20 52 55)
		(21 19 55 54)
		(47 55 52 44)
		(54 55 47 46)
		(26 52 20 28)
		(58 44 52 26)
		(45 103 104 53)
		(103 58 26 104)
		(21 54 27 29)
		(27 54 46 59)
		(53 27 59 45)
		(32 26 28 36)
		(39 53 104 105)
		(105 104 26 32)
		(33 27 53 39)
		(37 29 27 33)
		);
	}

);

mergePatchPairs
(


);

// ************************************************************************* //
